src/cf/InformationRegisters/ТекстыПисем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ТекстыПисем</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТекстПисьма</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИДУчетнойЗаписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Письмо</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВходящееПисьмо</v8:Type>
						<v8:Type>cfg:DocumentRef.ИсходящееПисьмо</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ТекстыПисем/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// получает строковое представление GUID учетной записи - для полнотекстового поиска
Функция GUIDУчетнойЗаписи(УчетнаяЗапись) Экспорт
	
	ИдСтрока = Строка(УчетнаяЗапись.УникальныйИдентификатор());
	
	ИдСтрока = СтрЗаменить(ИдСтрока, "-", "");
	
	ИдСтрока = СтрЗаменить(ИдСтрока, "A", "10");
	ИдСтрока = СтрЗаменить(ИдСтрока, "a", "10");
	ИдСтрока = СтрЗаменить(ИдСтрока, "B", "11");
	ИдСтрока = СтрЗаменить(ИдСтрока, "b", "11");
	ИдСтрока = СтрЗаменить(ИдСтрока, "C", "12");
	ИдСтрока = СтрЗаменить(ИдСтрока, "c", "12");
	ИдСтрока = СтрЗаменить(ИдСтрока, "D", "13");
	ИдСтрока = СтрЗаменить(ИдСтрока, "d", "13");
	ИдСтрока = СтрЗаменить(ИдСтрока, "E", "14");
	ИдСтрока = СтрЗаменить(ИдСтрока, "e", "14");
	ИдСтрока = СтрЗаменить(ИдСтрока, "F", "15");
	ИдСтрока = СтрЗаменить(ИдСтрока, "f", "15");
	
	Возврат ИдСтрока;
	
КонецФункции	

// заносит текст письма в регистр ТекстыПисем
Процедура ЗаписатьТекстПисьма(ПисьмоСсылка, УчетнаяЗапись, ТекстПисьмаПростойТекстХранилище) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьПолнотекстовыйПоиск") Тогда
		Возврат;
	КонецЕсли;	
	
	УстановитьПривилегированныйРежим(Истина);

	ИдУчетнойЗаписи = GUIDУчетнойЗаписи(УчетнаяЗапись);
	
	МенеджерЗаписи = РегистрыСведений.ТекстыПисем.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Письмо = ПисьмоСсылка;
	МенеджерЗаписи.ТекстПисьма = ТекстПисьмаПростойТекстХранилище;
	МенеджерЗаписи.ИДУчетнойЗаписи = ИдУчетнойЗаписи;
	МенеджерЗаписи.Записать();

КонецПроцедуры			

#КонецОбласти

#КонецЕсли
